railsapp/app/controllers/reports_controller.rb

  def index
    @reports = Report.all
---
SELECT `reports`.* FROM `reports`