auth/app/controllers/reports_controller.rb

SELECT `reports`.* FROM `reports`
---
  def index
    @reports = Report.all

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 0 LIMIT 1
---
  def show
    @report = Report.find(params[:id])

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
---
  def edit
    @report = Report.find(params[:id])

INSERT INTO `reports` (`created_at`, `homework_id`, `quality`, `ratio`, `student_id`, `time`, `updated_at`) VALUES ('2013-06-06 07:25:40', 1, 0.5, 0.5, 1, 1.5, '2013-06-06 07:25:40')
---
  def create
    @report = Report.new(params[:report])

    respond_to do |format|
      if @report.save

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
---
  def update
    @report = Report.find(params[:id])

SELECT `reports`.* FROM `reports` WHERE `reports`.`id` = 1 LIMIT 1
DELETE FROM `reports` WHERE `reports`.`id` = 1
---
  def destroy
    @report = Report.find(params[:id])
    @report.destroy